Repository: dhuuphuoc/Seconhand_sharing_mobile
Catalog: lib/l10n/intl_*.arb
Languages: vi

source: Login
vi: Đăng nhập

source: Logout
vi: Đăng xuất

# logoutConfirmation
source: Are you sure you want to logout?
vi: Bạn có muốn đăng xuất không?

# loginHint
source: Login to share your items
vi: Đăng nhập để chia sẻ món đồ của bạn

source: Register for free
vi: Đăng ký miễn phí

source: Forgot password
vi: Quên mật khẩu

source: Register
vi: Đăng ký

# registerHint
source: Please enter the required information below to proceed with the registration
vi: Vui lòng nhập thông tin theo yêu cầu bên dưới để thực hiện đăng ký

# name
source: Full name
vi: Họ tên

source: Password
vi: Mật khẩu

source: Username
vi: Tên tài khoản

source: Confirm password
vi: Xác nhận mật khẩu

# forgotPasswordHint
source: Please give us email address access your account
vi: Hãy đưa chúng tôi thông tin truy cập tài khoản của bạn

# continueButton
source: Continue
vi: Tiếp tục

# invalidUsername
source: Username must be at least 6 characters
vi: Tên tài khoản phải chứa ít nhất 6 ký tự

# verifyCode
source: Enter verify code
vi: Nhập mã xác thực

# verifyCodeHint
source: Enter the 4-digit verification code sent to your email
vi: Nhập mã xác thực bao gồm 4 số được gửi về email

source: Confirm
vi: Xác nhận

source: Send Code
vi: Gửi lại mã

# anotherEmail
source: Use another Email
vi: Dùng địa chỉ Email khác

# resetPasswordNote
source: Note: Do not share your authentication code and password with anyone to avoid unexpected events
vi: Lưu ý: Không chia sẻ mã xác thực và mật khẩu cho bất kì ai để tránh trường hợp không mong muốn xảy ra

# emptyEmailError
source: Email can't be empty
vi: Email không được bỏ trống

source: Invalid email
vi: Email không hợp lệ

# emptyPasswordError
source: Password can't be empty
vi: Mật khẩu không được bỏ trống

# validatePassword
source: Password must contain at least eight characters, at least one letter and one number
vi: Mật khẩu phải chứa ít nhất 8 kí tự, ít nhất 1 chữ và 1 số

# matchPassword
source: Confirm password must match with password
vi: Xác nhận mật khẩu phải khớp với mật khẩu

source: Donate
vi: Quyên tặng

source: Title
vi: Tiêu đề

source: Phone number
vi: Số điện thoại

source: Description
vi: Mô tả

source: Post
vi: Đăng

source: Try again
vi: Thử lại

source: Failed
vi: Thất bại

# postFailed
source: An error occurred while posting!
vi: Có lỗi trong quá trình đăng bài!

# loginFailedNotification
source: Username or password is incorrect.
vi: Tên tài khoản hoặc mật khẩu không đúng.

source: Add photos
vi: Thêm ảnh

source: Success
vi: Thành công

# registerSuccess
source: Register Successful. Check your confirm email
vi: Đăng ký thành công. Kiểm tra email xác nhận của bạn

# registerFailedNotification
source: Register information is incorrect
vi: Thông tin đăng ký không

# emptyFullNameError
source: Full Name can't be empty
vi: Tên không được bỏ trống

source: Add photo
vi: Thêm ảnh

source: Choose image
vi: Chọn ảnh

# postItem
source: Post
vi: Đăng bài viết

source: All
vi: Tất cả

source: Clothes
vi: Quần áo

source: Sport
vi: Thể thao

source: Study
vi: Học tập

source: Houseware
vi: Đồ gia dụng

source: Electronic
vi: Điện tử

source: Furniture
vi: Nội thất

source: Other
vi: Khác

source: day
vi: ngày

source: month
vi: tháng

source: year
vi: năm

source: hour
vi: giờ

source: minute
vi: phút

source: second
vi: giây

source: Address
vi: Địa chỉ

# addressHint
source: Number, street
vi: Số nhà, tên đường

source: Ward
vi: Phường xã

source: District
vi: Quận huyện

source: Province
vi: Tỉnh thành

source: Viet Nam
vi: Việt Nam

source: Receive address
vi: Địa chỉ nhận

# provinceEmptyError
source: Province can't be empty!
vi: Tỉnh thành không được trống!

# districtEmptyError
source: District can't be empty!
vi: Quận huyện không được trống!

# wardEmptyError
source: Ward can't be empty!
vi: Phường xã không được trống!

# addressEmptyError
source: Address can't be empty!
vi: Số nhà, tên đường không được bỏ trống

# addressError
source: Address must be filled completely!
vi: Địa chỉ cần phải điền hoàn chỉnh

source: Invalid phone number!
vi: Số điện thoại không hợp lệ!

# titleEmptyError
source: Title can't be empty!
vi: Tiêu đề không được bỏ trống!

# descriptionEmptyError
source: Description can't be empty!
vi: Phần mô tả không được bỏ trống!

# notEnoughImages
source: Item must have at least one images!
vi: Phải có ít nhất một hình ảnh của đồ vật!

source: Images
vi: Hình ảnh

source: Posted
vi: Đã đăng

# postedNotification
source: Your item is posted! Thank you so much!
vi: Vật dụng của bạn đã được đăng! Cảm ơn bạn rất nhiều!

# postError
source: An error occurred while posting
vi: Có lỗi trong quá trình đăng bài

source: Posts
vi: Bài đăng

source: Error
vi: Lỗi

# checkMailForgotPassword
source: Check your email
vi: Kiểm tra email của bạn

# notExistEmail
source: Your email does not exist
vi: Email của bạn không tồn tại

# grantStoragePermission
source: Allow 2Hand-Sharing access device's storage
vi: Cho phép 2Hand-Sharing truy cập vào bộ nhớ

# grantStoragePermissionHint
source: Grant access permission in settings to upload your item's images
vi: Cấp quyền truy cập trong cài đặt để gửi hình ảnh đồ vật bạn muốn cho

source: Allow access
vi: Cho phép truy cập

source: Reset password
vi: Thay đổi mật khẩu

# resetPasswordHint
source: Insert your new password to change
vi: Nhập vào mật khẩu mới của bạn để thay đổi

# endNotifyMessage
source: Your have seen all posts
vi: Bạn đã xem tất cả các bài viết

source: Detail
vi: Thông tin chi tiết

source: Register to receive
vi: Đăng ký nhận

# resetPasswordSuccess
source: Your password was reset
vi: Mật khẩu của bạn đã được đặt lại

# resetPasswordFailed
source: Recovery link is expired
vi: Đường dẫn khôi phục đã hết hạn

source: Yes
vi: Có

source: No
vi: Không

source: Message
vi: Lời nhắn

source: Registered
vi: Đã đăng ký

# cancelRegister
source: Cancel registration
vi: Hủy đăng ký

source: Pending
vi: Đã đăng ký

source: Accepted
vi: Đã chấp nhận

source: Unregistered
vi: Chưa đăng ký

source: Registrations
vi: Lượt đăng ký

source: Accept
vi: Chấp nhận

source: Cancel
vi: Hủy

source: Confirm sent
vi: Xác nhận đã cho

source: Complete
vi: Hoàn thành

# messageEmptyError
source: Message can't be empty
vi: Lời nhắn không thể bỏ trống

source: Contact
vi: Liên hệ

source: Date of Birth
vi: Ngày sinh

# emptyPhoneError
source: Phone number can't be empty
vi: Số điện thoại không được bỏ trống

# contactDenied
source: Your registration isn't accepted
vi: Đăng ký nhận của bạn chưa được chấp nhận

source: Close
vi: Đóng

source: Send thanks
vi: Gửi lời cảm ơn

# thanks
source: Thank you so much!
vi: Cảm ơn bạn rất nhiều!

source: Send
vi: Gửi

source: Thanks message
vi: Lời cảm ơn

source: Thanks sent!
vi: Lời cảm ơn của bạn đã được gửi đi

source: Profile
vi: Thông tin cá nhân

source: Donation
vi: Quyên góp

source: Save
vi: Lưu

source: Confirm Email
vi: Xác nhận email

# confirmEmailFail
source: Confirm email is not correct. Check your confirm email
vi: Xác nhận email của bạn không . Vui lòng kiểm tra lại email

# confirmEmailHint
source: Press button CONFIRM to complete process register account on our system
vi: Bấm nút XÁC NHẬN để hoàn tất quy trình đăng ký tài khoản trên hệ thống

source: Category
vi: Phân loại

# categoryUnselectedError
source: You haven't selected category of your item yet!
vi: Bạn chưa phân loại cho vật phẩm

source: Send message
vi: Nhắn tin

source: Cancel accept
vi: Hủy chấp nhận

# cancelAlert
source: Do you want to cancel {fullName}'s accept?
vi: Bạn có muốn hủy chấp nhận đăng ký của {fullName}?

# confirmationSentMessage
source: Are you sure? Just confirm when the item was sent. The item will be closed after confirm sent!
vi: Bạn chắc chứ? Chỉ xác nhận khi vật phẩm đã được gửi đi, vật phẩm sẽ đóng lại sau khi xác nhận!

# incomingReceiveRequest
source: {fullName} registered to receive your {itemName} with message: {message}
vi: {fullName} đã đăng ký nhận vật phẩm {itemName} của bạn với lời nhắn: {message}

# registeredItem
source: registered to receive your
vi: đã đăng ký nhận vật phẩm

source: with message:
vi: của bạn với lời nhắn:

source: Back
vi: Quay lại

# sentNotification
source: This item is donated for {fullName}
vi: Vật phẩm này đã được tặng cho {fullName}

# incomingReceiveRequestSnackBar
source: {fullName} registered to receive your item
vi: {fullName} đã đăng ký nhận vật phẩm

# cancelReceiveRequestSnackBar
source: {fullName} cancelled his request
vi: {fullName} đã hủy đăng ký

source: Your registration was
vi: Đăng ký nhận của bạn đã được

source: Your accepted registration was
vi: Đăng ký nhận của bạn đã bị

# acceptedLowerCase
source: accepted
vi: chấp nhận

# canceledLowerCase
source: canceled
vi: hủy chấp nhận

# cancelRegistrationMessage
source: Do you want to cancel this registrations?
vi: Bạn có muốn hủy đăng ký nhận vật phẩm này không?

source: you
vi: bạn

# youUpperCase
source: You
vi: Bạn

# thanksNotification
source: Thanks: {content}
vi: Lời cảm ơn: {content}

source: sent thanks to you:
vi: đã gửi lời cảm ơn đến bạn:

# confirmSentNotification
source: Item owner have confirmed donate the item for {receiver}
vi: Chủ sở hữu đã xác nhận tặng vật phẩm cho {receiver}

# confirmSentTo
source: Item owner have confirmed donate the item for
vi: Chủ sở hữu đã xác nhận tặng vật phẩm cho

source: Notification
vi: Thông báo

# confirmSentSuccess
source: You confirmed donate for {receiver}
vi: Bạn đã xác nhận tặng cho {receiver}

source: Group
vi: Nhóm

source: Create Group
vi: Tạo nhóm

source: Group Name
vi: Tên nhóm

# rule
source: Rules
vi: Các luật lệ

# groupNameEmptyError
source: Group Name can't be empty
vi: Tên nhóm không được bỏ trống

# ruleEmptyError
source: Rules can't be empty
vi: Luật lệ không được bỏ trống

source: Create group success
vi: Tạo nhóm thành công

# createGroupFail
source: Create group fail. Please try again
vi: Tạo nhóm thất bại. Vui lòng thử lại

source: Group Detail
vi: Chi tiết nhóm

# notificationEnded
source: There is no more notification
vi: Không còn thông báo nào nữa

# messagesEnded
source: There is no more messages
vi: Không còn tin nhắn nào nữa

# messageBox
source: Messages box
vi: Hộp thoại

source: Member
vi: Thành viên

source: Home address
vi: Địa chỉ nhà

# avatarChangeConfirmation
source: Your avatar will be changed to selected image!
vi: Ảnh đại diện của bạn sẽ được đổi thành ảnh đã chọn!

source: Are you sure?
vi: Bạn chắc chứ?

# registeredNotification
source: You registered this item and waiting for acceptance ...
vi: Bạn đã đăng ký nhận vật phẩm này và đang chờ chủ sở hữu chấp nhận ...

# noMoreEvent
source: There is no more events
vi: Không còn sự kiện nào nữa

source: Event
vi: Sự kiện

source: Joined group
vi: Nhóm đã tham gia

# requestToJoin
source: Requests to join
vi: Yêu cầu tham gia

source: Kick
vi: Khai trừ

source: Add as admin
vi: Thêm làm quản trị viên

source: Add member
vi: Thêm thành viên

source: Invitation was sent
vi: Lời mời đã được gửi đi

# emailNotExist
source: Email not exists
vi: Email không tồn tại

# memberExisted
source: This user already existed in group
vi: Người này đã là thành viên của nhóm

# youAreNotAdmin
source: You are not group's admin
vi: Bạn không phải là quản trị viên của nhóm

source: Glory
vi: Vinh danh
